docs-html/review-agenda.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Documentation Review Agenda</title>
<meta name="author" content="Scimax VSCode" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.9.0/styles/default.min.css" />
</head>
<body>
<main class="org-content">
<header id="title-block">
<h1 class="title">Documentation Review Agenda</h1>
<p class="author">Scimax VSCode</p>
</header>
<div class="org-preamble"><p>This file generates a dynamic agenda of documentation headings that need review.
Headings marked with ⚠️ are new and need inspection before being marked ✅.</p>
</div>
<div id="org-generate-review-agenda" class="org-section org-level-1">
<h1>Generate Review Agenda</h1>
<p>Run this block (C-c C-c) to generate the current review agenda from docs/*.org files.</p>

<div class="org-src-container">
<pre class="src src-typescript"><code class="language-typescript">import * as fs from &#39;fs&#39;;
import * as path from &#39;path&#39;;
import { org } from &#39;../src/parser/orgModify&#39;;

// Get docs directory
const docsDir = &#39;/Users/jkitchin/Dropbox/emacs/projects/scimax_vscode/docs&#39;;

// Custom TODO keywords used in documentation files
const parserConfig = {
    todoKeywords: [&#39;⚠️&#39;, &#39;👀&#39;],  // In-progress states
    doneKeywords: [&#39;✅&#39;]          // Done state
};

// Collect all items needing review, grouped by file
const itemsByFile = new Map&lt;string, Array&lt;{level: number; title: string; line: number}&gt;&gt;();

const orgFiles = fs.readdirSync(docsDir)
    .filter(f =&gt; f.endsWith(&#39;.org&#39;) &amp;&amp; f !== &#39;review-agenda.org&#39;)
    .sort();

for (const filename of orgFiles) {
    const filePath = path.join(docsDir, filename);
    const doc = org.parseFile(filePath, parserConfig);

    // Query all headlines with ⚠️ TODO keyword (needs review)
    const warnings = org.filterHeadlines(doc, h =&gt;
        h.properties.todoKeyword === &#39;⚠️&#39;
    );

    if (warnings.length &gt; 0) {
        itemsByFile.set(filename, warnings.map(h =&gt; ({
            level: h.properties.level,
            title: h.properties.rawValue,
            line: h.location?.start.line ?? 0
        })));
    }
}

// Output org-formatted agenda
const total = Array.from(itemsByFile.values()).reduce((sum, items) =&gt; sum + items.length, 0);
console.log(`* Review Agenda (${total} items)`);
console.log();

if (itemsByFile.size === 0) {
    console.log(&#39;No items marked with ⚠️ found. All documentation reviewed!&#39;);
} else {
    for (const [filename, items] of itemsByFile) {
        console.log(`** [[file:${filename}][${filename}]] (${items.length} items)`);
        for (const item of items) {
            const link = `[[file:${filename}::${item.line}][${item.title}]]`;
            console.log(`${&#39;*&#39;.repeat(item.level + 2)} ⚠️ ${link}`);
        }
        console.log();
    }
}</code></pre>
</div>


</div>
<div id="org-current-review-status" class="org-section org-level-1">
<h1>Current Review Status</h1>
<!-- Unknown element type: property-drawer -->
<p>The results from running the above block will appear here after execution.
Items link directly to the source file and line number for quick navigation.</p>

<div id="org-workflow" class="org-section org-level-2">
<h2>Workflow</h2>
<ol>
<li><p>Run the source block above with <code class="verbatim">C-c C-c</code></p>
</li>
<li><p>Click on any item link to jump to that heading</p>
</li>
<li><p>Review the content</p>
</li>
<li><p>Change the heading&#39;s TODO state from ⚠️ to ✅ when satisfied</p>
</li>
<li><p>Re-run the block to update the agenda</p>
</li>
</ol>

</div>
<div id="org-legend" class="org-section org-level-2">
<h2>Legend</h2>
<table class="org-table">
<thead>
<tr><th>State</th><th>Meaning</th></tr>
</thead>
<tbody>
<tr><td>⚠️</td><td>New heading, needs review</td></tr>
<tr><td>👀</td><td>Changed heading, needs review</td></tr>
<tr><td>✅</td><td>Reviewed and approved</td></tr>
</tbody>
</table>

</div>
</div>
</main>
</body>
</html>